app/controllers/applications_controller.rb

SELECT `applications`.* FROM `applications`
---
  def index
    @applications = Application.all

INSERT INTO `applications` (`created_at`, `updated_at`, `name`, `chats_count`, `application_token`) VALUES ('2022-05-16 02:17:29.420442', '2022-05-16 02:17:29.420442', 'newApp', 0, 'T5bBnwi16PFBPhhDfxUn6qc3')
---
  def create
    @application = Application.new(application_params)
    @application.chats_count = 0

    @application.save

SELECT `applications`.* FROM `applications` WHERE `applications`.`application_token` = 'T5bBnwi16PFBPhhDfxUn6qc3' LIMIT 1
---
  def show
    @application = Application.find_by!(application_token: params[:application_token])